Autodesk.Revit.UI.IsolateAnnotationsEditMode.IsInEditMode(Autodesk.Revit.DB.Document)
Returns true if the active document is currently in the isolate annotations edit mode.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027.3

Autodesk.Revit.UI.IsolateAnnotationsEditMode.Cancel(Autodesk.Revit.DB.Document)
Requests cancelling the isolate annotations edit mode on the active document, discarding the changes.
Posts the native command to run when control returns to Revit (the edit mode's transaction lifecycle
must run in the UI context, not the API context). Returns false if the isolate annotations edit mode is
not currently active; true if the cancel command was posted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027.3

Autodesk.Revit.UI.IsolateAnnotationsEditMode.Finish(Autodesk.Revit.DB.Document)
Requests finishing (completing) the isolate annotations edit mode on the active document, keeping the changes.
Posts the native command to run when control returns to Revit (the edit mode's transaction lifecycle
must run in the UI context, not the API context). Returns false if the isolate annotations edit mode is
not currently active; true if the finish command was posted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027.3

Autodesk.Revit.UI.IsolateAnnotationsEditMode
The event arguments used by the OptimizeAnnotationsEditModeExitedEventArgs event.